Repository: Omarshehab10/DualPractice
Catalog: Common/Localization/SharedResources.*.resx
Languages: ar

# Add_Request_Failed
source: Failed to add request
ar: فشل في إضافة الطلب

# Balance_Not_Enough
source: Organization Does Not Have Enough Balance to Proceed
ar: لا يوجد لدى المنشأة رصيد كافي لاتمام العملية

# DUP_Report_Not_Found
source: There Is No Approved Request with This Number
ar: لايوجد تقرير تمت الموافقة عليه بهذا الرمز

# Error_Generate_Pdf
source: An Error occurred while generating the file, please try later
ar: حصل خطأ اثناء طباعة التقرير, الرجاء المحاولة مره اخرى

# Error_Yakeen_Data_Not_Found
source: Please check identification number or date of birth
ar: فضلًا التحقق من رقم الهوية أو تاريخ الميلاد

# Establishment_Data_Not_Found
source: Please check CR number or license number of the organization
ar: فضلًا التحقق من رقم ترخيص المنشأة

# Establishment_License_Expired
source: Establishment License is Expired
ar: ترخيص المنشأة منتهي

# Establishment_Org_Id_Null
source: Establishment Org Id is Null
ar: لم يتم العثور على رقم المنشأة التي يعمل بها الممارس

# Establishment_Status_Error
source: Establishment Status is not Final
ar: ترخيص المنشأة يجب ان يكون نهائي

# Gregorian_DOB_Not_Added
source: The practitioner is not registered with a Gregorian date of birth
ar: الممارس غير مسجل له تاريخ ميلاد ميلادى

# Hijri_DOB_Not_Added
source: The practitioner is not registered with a Hijri date of birth
ar: الممارس غير مسجل له تاريخ ميلاد هجرى

# HLS_Data_Not_Found
source: CR Number or License Number is Not Found
ar: لم يتم العثور على بيانات صلاحية المنشاة

# Open_Request_Practitioner_Same_Organization
source: Sorry, the facility has a previous request for the same practitioner
ar: عذرا يوجد لدى المنشآة طلب سابق لنفس الممارس

# Organization_LicenseNumber_Null
source: Organization LicenseNumber is Null
ar: لم يتم العثور على رقم ترخيص المنشأة

# Organization_Not_Found
source: Organization Data Not Found
ar: لم يتم العثور على بيانات المنشأة

# Practitioner_Already_Added
source: This practitioner is already added to your facilities
ar: هذا الممارس مضاف مسبقا لمنشآتكم

# Practitioner_Already_Approved
source: Sorry, the practitioner has valid approval
ar: عذرًا يوجد لدى الممارس موافقة سارية

# Practitioner_Gov_Org_Is_Null
source: Practitioner governmental organization is not registered in seha
ar: جهة عمل الممارس الحكوميه غير مسجله فى صحه

# Practitioner_Has_Existing_Request
source: Sorry the practitioner has an existing request
ar: عذرا الممارس لديه طلب قائم

# Practitioner_Has_No_Approved_Requests
source: This Practitioner has no approved requests
ar: هذا الممارس لا يوجد لديه موافقات ساريه

source: Practitioner Nationality Not Found
ar: لم يتم العثور على بيانات الجنسية

# Practitioner_Not_Consultant
source: Practitioner must be a Medical Consultant
ar: الممارس يجب ان يكون استشاري

# Practitioner_Not_In_Gov_Est
source: Practitioner is not working in govermental establishment
ar: الممارس لا يعمل في جهة حكومية

# Practitioner_Not_Saudi
source: Practitioner must be Saudi
ar: الممارس يجب ان يكون سعودي

# Practitioner_requests_Not_Found
source: There's no requests for this practitioner
ar: لا يوجد طلبات مسجله لهذا الممارس

# Request_Rejected
source: The request has been rejected successfully
ar: تم رفض الطلب بنجاح

# Request_Sent
source: The request has been sent successfully
ar: تم ارسال الطلب بنجاح

# Request_Status_Is_Not_Correct
source: This Request status is not waiting practitioner approval
ar: حالة الطلب غير صحيحه - ليس بانتظار موافقة الممارس

# Request_Status_Not_Waiting_Gov1_Review
source: Request Status Must Be Waiting for Government Establishment Review
ar: حالة الطلب غير صحيحه - ليس بانتظار موافقة المنشأة الحكومية

# Request_Status_Not_Waiting_Gov2_Review
source: Request Status Must Be Waiting for Government Level Two Establishment Review
ar: حالة الطلب غير صحيحه - ليس بانتظار موافقة المنشأة الحكومية المستوى الثانى

# Request_Status_Not_Waiting_Payment
source: Request Status Must Be Waiting for Payment
ar: حالة الطلب غير صحيحه - ليس بإنتظار دفع الرسوم

# Scfhs_Registration_Expired
source: Scfhs Registration Date is Expired
ar: تصنيف الممارس منتهي لدى الهيئة السعودية للتخصصات الصحية

# Seha_GetOrganizationData_Error
source: An Error occurred while getting the Organization Data from Seha
ar: حدث خطأ اثناء جلب معلومات المنشأة من صحة

# Seha_InquireBalance_Error
source: An Error occurred while checking the Organization Balance from Seha
ar: حدث خطأ اثناء التحقق من رصيد المنشأة بصحة

# Seha_ServicePoints_Error
source: An Error occurred while getting the service price from Seha
ar: حدث خطأ اثناء جلب سعر الخدمة من صحة

source: Seha User Not Found
ar: خطأ في جلب بيانات المستخدم من صحة

# ServiceName
source: Dual Practice
ar: خبير الصحة

# There_No_Resuests
source: There are no requests
ar: لا يوجد طلبات لهذه المنشأة

# There_Two_Request_Same_Practitioner
source: There is an existing or already accepted request in the system, please reject/cancel one of them
ar: يوجد طلب قائم أو مقبول مسبقاً في النظام يرجى رفض/الغاء احدهم

source: This practitioner is not found
ar: لا يوجد ممارس مسجل بهذه الهويه

# This_Request_Is_Not_Found
source: This request is not found, please check the request id
ar: لا يوجد طلب بهذا الرقم، برجاء التحقق من رقم الطلب

# Wrong_DOB
source: Please check the entered Birth Date
ar: يرجى التحقق من تاريخ الميلاد المدخل

# Max_Total_Hours_Per_Day
source: The number of hours per day should not exceed 8 hours
ar: يجب ألا يتجاوز عدد الساعات في اليوم 8 ساعات

# Practitioner_Has_Valid_Hls_License
source: The practitioner has a valid license to practice the profession, please cancel it and try again
ar: يوجد لدى الممارس ترخيص مزاولة مهنة ساري، الرجاء إلغاءها والمحاولة مرة أخرى

# License_Pri_Org_Is_Null
source: The license expiry date for the facility is not registered
ar: تاريخ إنتهاء الرخصة للمنشأة الخاصة غير مسجل

# Cancel_Request_Failed
source: Failed to revoke consent
ar: فشل في إلغاء الموافقة

# Request_Canceled
source: Approval has been successfully revoked
ar: تم الغاء الموافقة بنجاح

# Request_Status_Not_Approved
source: Request Status Must Be Approved
ar: حالة الطلب غير صحيحة - ليس مقبول

# This_Practitioner_Is_Not_Found_In_Ethaq
source: The practitioner is not registered in the Ethaq system
ar: الممارس غير مسجل في نظام إيثاق

# Approval_Is_Less_Than_30_Days
source: the approval cannot be canceled, because the remaining days for the approval to end are less than 30 days
ar: لايمكن إلغاء الموافقة لأن عدد الأيام المتبقية لانتهاء الموافقة أقل من 30 يوم

# Email_Not_Send
source: A problem occurred while sending the email to the user
ar: حدث مشكله اثناء ارسال البريد الالكترونى للمستخدم

# Email_Subject_New_Request
source: New Request - Dual Practice System
ar: طلب جديد - نظام خبير الصحة

# Email_Subject_Cancel_Request_By_GovOrg
source: Cancellation of approval by the government organization
ar: إلغاء الموافقة من قبل المنشأة الحكومية

# Email_Subject_Cancel_Request_By_PrivOrg
source: Cancellation of approval by the private organization
ar: إلغاء الموافقة من قبل المنشأة الخاصة

# Email_Update_On_TheStatus_Of_request_Subj
source: Request updates - Khabeer Alseha
ar: تحديث على حالة طلب - نظام خبير الصحة

# Rejection_Reason_Id_required
source: Rejection Reason id is required
ar: يجب إدخال معرف سبب الرفض

# Wrong_Rejection_Reason_Id
source: Rejection Reason id is wrong
ar: معرف سبب الرفض خطأ

# Request_Aproved
source: The request has been approved successfully
ar: تمت الموافقة على الكلب بنجاح
